
{
    "job1": "About the job\n$130,700.00-$215,800.00\n\nCompany Overview\n\nThe people of Memorial Sloan Kettering Cancer Center (MSK) are united by a singular mission: ending cancer for life. Our specialized care teams provide personalized, compassionate, expert care to patients of all ages. Informed by basic research done at our Sloan Kettering Institute, scientists across MSK collaborate to conduct innovative translational and clinical research that is driving a revolution in our understanding of cancer as a disease and improving the ability to prevent, diagnose, and treat it. MSK is dedicated to training the next generation of scientists and clinicians, who go on to pursue our mission at MSK and around the globe.\n\n Please review important announcements about vaccination requirements and our upcoming EHR implementation by clicking here . \n\n Important Note for MSK Employees: \n\nYour Career Hub profile is submitted to the hiring team as your internal resume. Please be sure your profile is fully complete with your skills, relevant experience and education (if required). Click here to learn more. Please note, this link is only accessible for MSK employees.\n\nJob Description\n\n Senior Business Intelligence Analyst – Revenue Cycle \n\nWe are looking for a Senior Business Intelligence Analyst to join our Data & Analytics Department with a focus on Revenue Cycle Analytics. This is an exciting opportunity to become a key player in our cutting-edge Digital, Informatics, and Technology division. You'll work on high-priority platforms supported by Digital Products & Informatics (DP&I), which focuses on the powerful interaction between people, processes, and technology to help deliver excellent care to its patients.\n\nAs part of our team, you'll manage a suite of clinical information systems, including the electronic health record and ancillary systems, ensuring decision support, health information exchange, and knowledge management. This role will provide you the chance to not only shape our revenue cycle strategies but also mentor and guide junior team members in a dynamic, collaborative, and growth-focused environment. If you're passionate about leveraging data to make a tangible impact and want to contribute to a mission-driven organization, we invite you to join us at MSK. This is your chance to make a meaningful impact through data-driven insights and join a team that values excellence and innovation. If you're ready to take your career to the next level, apply today!\n\nPosition Overview\n\n Analyze revenue cycle data to uncover trends, issues, and improvement opportunities in billing, collections, and financial performance. \n Collaborate with business users to understand their processes, gather and document requirements, and translate them into functional specifications for dashboards and reports. \n Design and optimize dimensional data models to support the reporting infrastructure. \n Identify project risks and work proactively with the team to deliver on project scope and timelines. \n Support the development of data governance processes, ensuring high data integrity through established policies and procedures. \n Create ad-hoc reports and queries and develop test plans to ensure the quality of reporting solutions. \n Provide leadership and technical insight, identifying system deficiencies, analyzing problems, and implementing corrective actions. \n\n Key Qualifications: \n\n 5+ years demonstrated ability developing reporting solutions against relational and dimensional underlying data in a multi-platform environment. \n Strong proficiency in SQL programming, deep knowledge of relational database design principles, and Tableau / data visualization & BI tools \n Revenue Cycle Data Analytics experience. \n Experience with DB2, R & Python programming a plus \n Exposure to SAFe or agile methodologies a bonus \n Epic Cogito, Caboodle and Clarity as well as Revenue Data Model Certifications a plus. \n\nCore Skills\n\n Extensive knowledge of healthcare revenue cycle processes, including billing, coding, and reimbursement methodologies. \n Ability to work effectively with complex information and navigate conflicting data points. \n Proven track record of achieving results, even under challenging circumstances. \n Strong planning and prioritization skills to meet organizational goals. \n Ability to build collaborative partnerships and communicate effectively across different audiences. \n An effective communicator, capable of determining how best to reach different audiences and carrying out communications based on that understanding. \n\n Additional Information: \n\n This role is based at MSK’s 633 Third Avenue location. \n Schedule: Full Time, Hybrid onsite 3 days a month \n Reporting to the Associate Director, Analytics \n\n Pay Range:  $120,200 - $192,300\n\n Helpful Links  :\n\n MSK Compensation Philosophy \n Review Our Greats Benefits Offerings \n\n Closing \n\nMSK is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sexual orientation, national origin, age, religion, creed, disability, veteran status or any other factor which cannot lawfully be used as a basis for an employment decision.\n\nFederal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. Please tell us if you require a reasonable accommodation to apply for a job or to perform your job. Examples of reasonable accommodation include making a change to the application process or work procedures, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment.",
    "job2": "About the job\n$130,700.00-$215,800.00\n\nCompany Overview\n\nThe people of Memorial Sloan Kettering Cancer Center (MSK) are united by a singular mission: ending cancer for life. Our specialized care teams provide personalized, compassionate, expert care to patients of all ages. Informed by basic research done at our Sloan Kettering Institute, scientists across MSK collaborate to conduct innovative translational and clinical research that is driving a revolution in our understanding of cancer as a disease and improving the ability to prevent, diagnose, and treat it. MSK is dedicated to training the next generation of scientists and clinicians, who go on to pursue our mission at MSK and around the globe.\n\n Please review important announcements about vaccination requirements and our upcoming EHR implementation by clicking here . \n\n Important Note for MSK Employees: \n\nYour Career Hub profile is submitted to the hiring team as your internal resume. Please be sure your profile is fully complete with your skills, relevant experience and education (if required). Click here to learn more. Please note, this link is only accessible for MSK employees.\n\nJob Description\n\n Clinical Senior Business Intelligence Analyst \n\n Exciting Opportunity at MSK: \n\nJoin us in driving impactful change at Memorial Sloan Ketterin g. As a Clinical Senior Business Intelligence Analyst, you'll play a vital part in advancing our mission to transform cancer care by analyzing complex business challenges and uncovering key insights that will directly inform strategic decisions at the highest level. By leveraging data from both internal and external sources, you will identify trends, interpret patterns, and forecast future outcomes, providing actionable recommendations that support MSK’s vision for innovative, patient-centered care. Your expertise will help shape strategic and tactical plans, enabling us to stay at the forefront of cancer research and treatment.\n\nAs a subject matter expert, you’ll not only contribute to our continued success but also have the opportunity to mentor and guide junior staff, fostering a collaborative environment focused on growth, learning, and excellence. If you're passionate about using data to make a difference and want to contribute to a cause that truly matters, we invite you to join our team at MSK.\n\n Position Overview: \n\n Analyzes Reporting architecture issues for current and new systems; formulates design specifications. Analyzes business requirements and proposes/recommends technical solutions for reporting and analytics. Provides analytics solutions to solve business issues \n Design and implement new reporting and analytics road map for the entire \n Analyze the new releases across all reporting and analytics functions and implement the new changes as per the departmental plan. \n This position will serve as a primary resource for data requests from applications within their scope. The position will involve routine data queries, as well as building complex data solutions including but not limited to composite reports, scorecards, and dashboards. \n The position will also monitor changes within various tools and react to them appropriately with configuration changes and stakeholder communication. \n Develops and maintains simple to complex application reports (advanced, composite and matrix, Scorecards, Dashboards, etc.…). \n Stay informed of new functionality available in databases and analytics applications and drive the deployment of feature releases. \n Coordinates testing on applications; ensures quality of applications provided to users; coordinates the quality of systems changes. Performs and coordinates test plans for assigned projects. \n\n Key Qualifications: \n\n 5+ years of basic and advanced reporting experience in healthcare setting a plus \n Experience building reports using the Composite, Matrix, Scorecards and \n Experienced with Data Models and one or more job related languages (g., SQL, Python, dbt, etc.) \n In-depth knowledge of one or more related application configurations. \n A basic understanding of integration systems and related security. \n Epic Cogito, Caboodle, and Clarity as well as Clinical Data Model certifications preferred \n\n Core Skills: \n\n Exceptional communication skills, with the ability to engage executives including clinical and non-clinical \n Proactively identifies recommendations to make the solution \n In depth understanding of business processes being supported \n Strong problem solving, troubleshooting and analytical skills. \n Superb verbal and written communication skills to effectively interact with team members and \n\n Additional Information: \n\n This role is based at MSK’s 633 Third Avenue location. \n Schedule: Full Time, Hybrid onsite 3 days a month \n Reporting to the Associate Director, Analytics \n\n Pay Range:  $120,200 - $192,300\n\n Helpful Links  :\n\n MSK Compensation Philosophy \n Review Our Greats Benefits Offerings \n\n Closing \n\nMSK is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment. All qualified individuals are encouraged to apply and will receive consideration without regard to race, color, gender, gender identity or expression, sexual orientation, national origin, age, religion, creed, disability, veteran status or any other factor which cannot lawfully be used as a basis for an employment decision.\n\nFederal law requires employers to provide reasonable accommodation to qualified individuals with disabilities. Please tell us if you require a reasonable accommodation to apply for a job or to perform your job. Examples of reasonable accommodation include making a change to the application process or work procedures, providing documents in an alternate format, using a sign language interpreter, or using specialized equipment.",
    "job3": "About the job\nWho we are\nOnMed is on a mission to significantly improve access to quality, affordable, and equitable care, especially in a world where both traditional and telemedicine channels of care are proving inadequate. OnMed’s patented CareStation is a virtual walk-in clinic where patients can get a personalized care experience in real time. Bottom line . . . we are a groundbreaking healthcare company with a singular goal - to make quality healthcare available to anyone, anywhere.\n\nWho you are\nYou are a highly skilled and experienced Business Intelligence Analyst with a focus on managing data analysis, retrieval and presentation at an enterprise level. In this role, you will be responsible for leveraging data to drive business decisions, improve operational efficiency, and identify growth opportunities. This role represents a unique opportunity to be at the first floor of a company that is poised to transform the healthcare access conversation in the country. You are excited about the mission and the ability to drive lasting change in the healthcare ecosystem. The Company is at an important inflection point in its growth trajectory, and you are energized at the opportunity to be on the core crew of a rocket ship.\n\nWhat you will be doing\nDevelop and maintain business intelligence solutions that drive strategic decisions, assess operational health, analyze the results of our customer solutions, and help us fine-tune the targeting and efficacy of our growth efforts.\nYou have a strong background in data architecture and are able to optimize the underlying data structure(s) to drive the smartest and fastest results from an analytics standpoint.\nHarness your business and technical skills to understand requirements, conduct data analysis, identify trends and patterns, and then provide insights that drive business performance. \nExcel at data visualization and create highly-intuitive dashboard and reports that are ready for internal and external consumption. A proven track of using Power BI is critical. It would be helpful to see sample of dashboards/reports that have been created by candidate.\nPresent findings and recommendations to senior management and stakeholders as a combination of raw analysis and highly intuitive dashboards/reports leveraging data visualization tools.\nEnsure data integrity and accuracy by implementing data governance best practices.\nPerform such other duties as may be assigned by the Director, Software Engineering at their discretion from time to time.\n\nWhat you need\nBachelor’s degree in Computer Science, Information Technology or Data Analytics\nMinimum of 4-5 years in business intelligence or data analysis roles\nProficiency in BI tools – primarily Power BI; additional Tableau expertise is preferable\nData model optimization skills to make BI processes more efficient, detailed and pertinent to business cases\nStrong SQL skills and experience\nExperience with PostgreSQL a plus\nExcellent analytical, problem-solving, and critical thinking skills\nAbility to translate complex data into actionable insights and recommendations\nStrong communication and presentation skills\nAdaptability to a fast-paced and dynamic work environment with often-changing priorities\nExperience in the healthcare industry is a plus\n\nThe OnMed employee experience\nOnMed offers a competitive salary and benefits package. Being on the ground floor of a young, fast-growing company offers an unparalleled employee experience that continues to evolve and mature.",
    "job4": "About the job\nOverview\n\nThe Business Intelligence Analyst plays a crucial role in the organization, responsible for turning data into actionable insights that drive strategic business decisions. This role involves working with various teams to gather, analyze, and visualize data, providing valuable insights to support business operations and strategic planning.\n\nKey Responsibilities\n\nCollect, interpret, and analyze data to generate insights and identify trends.\nDevelop and maintain dashboards and reports.\nCommunicate findings to stakeholders using data visualization techniques.\nIdentify and recommend improvements to data collection and analysis processes.\nCollaborate with cross-functional teams to understand business needs and provide data-driven solutions.\nInterpret and analyze complex data sets to extract meaningful insights.\nImplement and maintain data models while ensuring data integrity.\nConduct ad-hoc analysis to support strategic decision-making.\nProvide regular performance and KPI reporting to stakeholders.\nIdentify opportunities for process improvement or automation.\n\nRequired Qualifications\n\nBachelor's degree in Business, Computer Science, Statistics, or related field.\nProven experience in data analysis and reporting.\nProficiency in SQL and database management.\nStrong understanding of data visualization tools such as Tableau, Power BI, or similar.\nAbility to interpret and communicate complex data sets.\nKnowledge of statistical methods and tools for analyzing large datasets.\nExperience with BI platforms and data modeling.\nSolid understanding of business operations and key performance indicators.\nAbility to translate business requirements into technical solutions.\nExcellent problem-solving and critical thinking skills.\n\nSkills: data analysis,sql,data visualization,business acumen,business operations,operations,business intelligence",
    "job5": "About the job\nOverview\n\nThe Business Intelligence Analyst plays a crucial role in leveraging data to provide actionable insights for strategic decision-making within the organization. This role is essential for interpreting data, analyzing results, and developing strategies to support the business objectives. The Business Intelligence Analyst will work closely with various departments to gather and analyze data, create visualizations, and identify trends and opportunities.\n\nKey Responsibilities\n\nUtilize data analysis techniques to provide meaningful insights and drive informed decision-making.\nDevelop and maintain reports and dashboards to track key performance indicators (KPIs).\nExtract, clean, and validate data to ensure accuracy and reliability for analysis.\nCreate data visualizations to effectively communicate findings to stakeholders.\nAnalyze historical data and trends to identify opportunities for process improvements and efficiency.\nCollaborate with cross-functional teams to understand business needs and provide analytical support.\nParticipate in the design and development of business intelligence solutions and tools.\nConduct ad-hoc analysis to address specific business questions and challenges.\nAssist in the implementation and maintenance of data management and reporting systems.\nStay updated with industry best practices and emerging trends in business intelligence and analytics.\n\nRequired Qualifications\n\nBachelor's degree in Computer Science, Business, Statistics, or related field.\nProven experience in data analysis and business intelligence roles.\nProficiency in SQL and database management.\nStrong understanding of data visualization tools such as Tableau, Power BI, or similar.\nAbility to interpret and analyze complex data sets.\nExcellent problem-solving and critical thinking skills.\nKnowledge of statistical analysis and modeling techniques.\nStrong business acumen and the ability to align analytical findings with business objectives.\nGood communication and presentation skills to effectively convey insights to non-technical stakeholders.\nExperience with ETL tools and processes is a plus.\nFamiliarity with programming languages such as Python or R is advantageous.\nProven ability to work effectively in a collaborative team environment.\nAttention to detail and a commitment to delivering high-quality work.\nAbility to prioritize and manage multiple tasks in a dynamic work environment.\nUnderstanding of data governance and data quality best practices.\n\nSkills: data analysis,sql,data visualization,business acumen,decision-making,analytics,business intelligence"
}

